; This is the Slovak language file for Open File shell for TC application, version 1.8a
; Information for translators.

; New lines (v1.7c -> v1.8a) are marked with the "; new" comments (above these lines),
; changed lines are marked with the "; changed" comment.
; Also, part of new strings is marked with the "; new (*)" symbols. While OpenFileTC
; wa in test, some translators have maked a temporary .lng-files. This mark show them
; all new strings. If you didn't make temp. translations, then do not make an attention on 
; this symbol - translate this string as new

; It's recommended to save this language file in Unicode. But if ANSI code works correctly
; in your country, then you can save language file in this code page.
;
; You can use "/s;" string (3 symbols, without quotes) to make a break in string.

; --------------------------------------------- ;
;						;
; Version 1.8b					;
; [Misc]					;
; 5=<Link to the OpenFileTC's discussing forum	;
;   on your native language if it exists>	;
;						;
; --------------------------------------------- ;
 
[Misc]           ; info about author of this language file. Please fill all fields correctly and put here info only about YOU :)
 ; language name, must be in your native letters
0=Slovensky        
 ; name of translator (man or company)
1=Ludvo
 ; supported OpenFileTC version
2=1.8b
 ; your contact information and copyrights. Will be enable only here, don't be published in OpenFileTC 
3=Total Commander Forum - Slovak and Czech 
 ; new: OpenFileTC discussing forum in your native language (if it exists)
5=http://ghisler.ch/board/viewtopic.php?t=16582

[MainUnit]       ; strings and messages for main window
0=Otvoriť súbor %FileName% ...
1=Preferované programy
2=Ďalšie programy
3=Klávesová skratka
4=Nedostupné programy
5=Iný program...
6=Vyberte program...
7=Zvolený súbor nie je spustiteľná aplikácia!/s;"%ProgramName%"./s;Typ súboru (prípona) nie je EXE./s;Naozaj chcete zvoliť tento program?
8=Program:
9=Prípona:
10=Cesta:
11=Program nenájdený!
12=Upraviť asociácie
13=Zmeniť cestu k programu
14=Premenovať
15=Klávesová skratka:
16=Odstrániť zo zoznamu
17=Premenovanie
18=Nový názov:
19=Naozaj chcete odstrániť program "%ProgramName%"/s;zo zoznamu (dostupných) aplikácií?
20=Upozornenie: Bol nájdený program Total Commander./s;Môžete nastaviť program "OpenFileTC" ako štandardný editor./s;%NowStandProgram%/s;Výhody:/s;- každý súbor môže byť otvorený klávesom F4 ODPOVEDAJÚCIM editorom/s;- jednoduché nastavenie asociácií/s;- OpenFileTC nie je "dotieravý"/s;/s;Pokiaľ chcete využívať tieto výhody stlačte ÁNO./s;Program vykoná potrebné nastavenia automaticky. /s;Tento dotaz sa zobrazí iba raz.
21=Ďakujeme za Váš výber!/s;/s;Pokiaľ máte práve spustený Total Commander (príp. dalšie inštancie),/s;prosím reštartujte ho (ich). Zmemy sa prejavia po opätovnom spustení Total Commandera.
22=Upozornenie: Bol nájdený program DbCD Universal./s;Môžete nastaviť program "OpenFileTC" ako štandardný prehliadač./s;%NowStandProgram%/s;Výhody:/s;- každý súbor môže byť otvorený klávesom F3 ODPOVEDAJÚCIM prehliadačom/s;- jednoduché nastavenie asociácií/s;- OpenFileTC  nie je "dotieravý"/s;/s;Pokiaľ chcete využívať tieto výhody, stlačte ÁNO./s;Program vykoná potrebné nastavenia automaticky. /s;Tento dotaz sa zobrazí iba raz.
23=Ďakujeme za Váš výber!/s;/s;Pokiaľ máte práve spustený DbCD Universal (príp. ďalšie inštancie),/s;prosím reštartujte ho (ich). Zmeny sa prejavia po opätovnom spusteniu DbCD Universal.
24=Vybrať program, ktorým bude otvorený/s;súbor %FileName%
25=Vždy použiť vybraný program k otvoreniu súboru tohto typu
26=Nastavenie %ProgramName%
27=Otvoriť, ale nesledovať program
28=Otvoriť v programe %ProgramName%
29=Počet spustení:
30=Program bol spustený bez parametrov. Nedoporučuje sa pridávať programy v tomto móde. Chcete aj tak pridať novú položku do zoznamu?
31=Nezobrazovať viac okno výberu pre súbory %FileType%,/s;automaticky otvorí súbor vybraným programom.
32=OK
33=Nastavenia OpenFileTC
34=Storno
35=Zoradiť
36=Zobraziť
37=Zobraziť ikony
38= Nastavenie pravidiel
39=Teraz je používaný: "%ProgramName%"
40=Zoznam všetkých programov
41=Editácia programu/s;/s;Skúšate editovat spustiteľný súbor:/s;"%FileName%"      /s;Chcete pridať tento súbor do zoznamu programov      /s;v hlavnom okne OpenFileTC?/s;/s;Stlačte ÁNO pre pridanie do zoznamu/s;Stlačte NIE pre editáciu tohto programu
42=Program bude zobrazený v okne
43=Nemožno vytvoriť skupinu pre položky programu. Sú možné chyby v programe.   
44=Nemožno vytvoriť konfiguračný súbor "%INIFileName%"./s;Pravdepodobne spúšťate program zo zariadenia určeného len na čítanie (CD-ROM, DVD-ROM), alebo je konfiguračný súbor chránený proti zápisu./s;OpenFileTC uloží nastavenie do zložky "%WinFolder%"
45=Chyba pri vytváraní konfiguračného súboru./s;súbor: "%INIFileName%"./s;Správa: "%SystemMessage%"./s;Chyba: "%ClassMessage%"./s;/s;Program bude ukončený.
46=Program otvorí len prvý vybraný súbor,/s;bez použitia úvodzoviek
47=Program otvorí len prvý vybraný súbor,/s;s použitím úvodzoviek
48=Každý z vybraných súborov bude otvorený v samostatnej /s;inštancii programu, bez použitia úvodzoviek
49=Každý z vybraných súborov bude otvorený v samostatnej /s;inštancii programu, s použitím úvodzoviek
50=Okno programu bude minimalizované
51=Pridať program, ktorým možno otvoriť/s;súbor vybraného typu
52=Okno programu bude maximalizované
53=Skryť tool bar
54=Pridaj nový editor
55=Nastav parametre editora
56=Vymaž editor zo zoznamu
57=Nastavenie možností programu OpenFile shell for TC
 ; new
58=Označ "%type%" typ ako podporovaný
 ; new
59=Odstráň "%type%" typ z podporovaných
 ; new: сообщение выскакивает 1 раз при запуске - отладка давнего бага
60=Od verzie 1.8b, OpenFileTC získal schopnosť rozpoznať aplikácie a nastaviť im potrebný typ spúšťania./s;Táto schopnosť umožnila odstrániť starú chybu keď niektoré aplikácie neboli odstránené z RAM pri spustení prostrodníctvom OpenFileTC/s;/s;OpenFileTC teraz skontroluje Vaše aplikácie. Chcete to? /s;/s;ÁNO - skontroluj a vykonaj potrebné zmeny/s;NIE - bez zmien/s;STORNO - opakuj otázku neskôr
 ; new
61=Notepad
 ; new
62=OpenFileTC nemôže otvoriť adresár s ini-súborom,/s;nastavenom v príkazovom riadku:/s;/s;   %OriginalINI%/s;/s;Teraz OpenFileTC použije základný ini-súbor:/s;/s;   %BasicINI%

[EditExtsUnit]   ; here strings and messages for extensions tuner window
0=Editácia prípon pre program "%ProgramName%"
1=OK
2=Storno
3=Pridať
4=Editovať
5=Odstrániť
6=Nová prípona
7=Prípona:
8=Otvoriť v programe %ProgramName%
9=Otvoriť "applications' selection window"
10=Akcie OpenFileTC
11=Prípona
12=Príkazový riadok
13=Povolené premenné:/s;/s;%1, %FullFileName% - kompletný názov súboru (vr. cesty a prípony)/s;%FileName% - iba názov súboru (bez cesty a prípony)/s;%FileExt% - prípona (bez bodky)/s;Premenné nerozlišujú malé a veľké písmená

[SetupUnit]    ; setup window
0=OpenFileTC - nastavenia
1=Jazyk:
2=Fonty a farby
3=Zobrazenie v hlavnom okne:
4=Vyberte požadovaný jazyk zo zoznamu/s;Viacej jazykových mutácií je dostupných na http://antoon-inc.com/oftc/
5=Sekcie
6=Ikony
7=Zoznam
8=Malé ikony
9=Report
10=Načítať ikony programov
11=Zobrazuje vlastné ikony programov
12=Použiť
13=Uložiť zmeny
14=OK
15=Uložiť zmeny a zavrieť okno
16=Storno
17=Zavrieť okno bez uloženia zmien
18=Samostatné nastavenie pre každého používateľa
19=Použite túto voľbu pre samostatné nastavenie OpenFileTC/s;pre každého používateľa tohto PC
20=Pokiaľ tento súbor existuje, každý používateľ používa svoje vlastné nastavenie programu OpenFileTC. Ak chcete používať rovnaké nastavenie pre všetkých používateľov, zmažte tento súbor. Tento komentár môže byť zmazaný.
21=Font...
22=Druh písma, veľkosť a farba pre text v hlavnom okne
23=Pozadie
24=Farba pozadia hlavného okna
25=Ukladať ikony do medzipamäte
26=Načíta ikony z programov iba raz/s;a uloží ich do podzložky s ikonami (doporučené)
27=Rôzne
28=Tuning
29=O programe
30=Vyberte druh zobrazenia
31=Nesledovať programy
32=Nečakať, až bežiaci program dokončí prácu s otvoreným súborom
33=Zobraziť podrobnosti pri kurzore myši
34=Štandardne sú podrobnosti o programe zobrazené/s;v pravej časti hlavného okna
35=Zobrazovať podrobnosti
36=Zobrazí podrobnosti o programoch v hlavnom okne,/s;pokiaľ si na ne nastavíte kurzor myši
37=Hlavné okno:
38=Dialógy:
39=Druh písma, veľkost a farba pre texty v ostatných oknách
40=Zoradiť položky v hlavnom okne:
41=Vyberte spôsob radenia položiek v hlavnom okne
42=Podľa názvu
43=Podľa počtu spustení
44=Voľba "Samostatné nastavenie pre každého používateľa" bude aktivovaná po reštarte OpenFileTC
45=Voľby pre vynútené volanie programu
46=Pri zapnutom/stlačenom klávese:
47=Pokiaľ je vybraný kláves zapnutý/pridržaný,/s; bude vždy zobrazené hlavné okno OpenFileTC
48=Pri umiestnení kurzora myši v:
49=Pokiaľ je kurzor myši vo vybranom rohu obrazovky,/s;bude vždy zobrazené hlavné okno OpenFileTC
50=Vyberte polohu kurzoru myši zo zoznamu
51=Vyberte kláves zo zoznamu
52=Ľavý horný roh obrazovky
53=Pravý horný roh obrazovky
54=Ľavý dolný roh obrazovky
55=Pravý dolný roh obrazovky
56=Zapnúť podporu pre otváranie zložiek
57=Povolí otvorenie vybranej zložky klávesom F4/s;Povolí premennú %Dir% ako podporovanú príponu/s;Viac informácií -> pozri súbor nápovedy OpenFileTC_*.chm
58=Stav políčka "Vždy použiť vybraný program k otvoreniu súboru tohto typu":
59=Tu môžete nastaviť východzí stav zaškrtávacieho políčka v hlavnom okne,/s;ktorý bude platný pri každom spustení OpenFileTC./s;Dostupné voľby sú "Vždy zapnuté", "Vždy vypnuté" a "Podľa poslednej voľby"
60=Podľa poslednej voľby
61=Vždy vypnuté
62=Vždy zapnuté
63=Pridať program do zoznamu editorov, pokiaľ na ňom užívatel stlačí kláves F4
64=Pokiaľ sa užívateľ pokusí editovať EXE-súbor,/s;OpenFileTC sa spýta, či má program pridať/s;do zoznamu editorov
65=Domovská stránka:
 ; new
66=Fórum:
 ; new
67=Ukáž tool bar
 ; new
68=Ukáž lištu s tlačítkami v hlavnom okne

[HotKeyUnit]    ; hot keys window
0=Klávesová skratka
1=Nastavte klávesovú skratku pre spúšťanie programu %ProgramName%
2=Nastavená kláves. skratka:
3=Nová klávesová skratka:
4=OK
5=Uložiť zmeny a zavrieť okno
6=Storno
7=Zavrieť okno bez uloženia zmien
8=Nie
9=Klávesová zkratka je rezervovaná programom OpenFileTC
10=Klávesovú skratku používa program %ProgramName%./s;Chcete ju nanovo nastaviť pre %CurrProgramName% a odstrániť pre predchádzajúci program?

[ProgramSettingsUnit]    ; Window for settings of one selected executable
0=%ProgramName% vlastnosti
1=Názov:
2=Cesta k programu:
3=Príkazový riadok (platné pre všetky prípony):
4=OpenFileTC nenašiel špecifikovaný súbor/s;Prosím, skontrolujte zadanú cestu
5=Zadajte názov programu - bude zobrazený v hlavnom okne
6=Plná cesta k programu
7=Vyberte súbor
8=Riešenie problémov s otváraním súborov
9=Žiadny problém
10=Nie je problém s otváraním viacerých/s;súborov v tomto programe
11=Poslať programu iba názov prvého vybraného súboru BEZ úvodzoviek
12=Pošle programu ako parameter iba názov prvého vybraného súboru,/s;nie kompletný zoznam vybraných súborov, a to BEZ úvodzoviek
13=Poslať programu iba názov prvého vybraného súboru S úvodzovkami
14=Pošle programu ako parameter iba názov prvého vybraného súboru,/s;nie kompletný zoznam vybraných súborov, a to S úvodzovkami
15=Každý z vybraných súborov bude otvorený v samostatnej inštancii programu, názov poslaný S úvodzovkami
16=Spustí požadovaný počet inštancií programu,/s;každá obdrží, ako parameter, jeden názov súboru zo zoznamu./s;Názov je poslaný S úvodzovkami./s;UPOZORNENIE: V tomto prípade prestane OpenFileTC sledovať programy  
17=Prípony...
18=Nastavenie prípon pre tento program
19=OK
20=Uložiť zmeny a zavrieť okno
21=Storno
22=Zavrieť okno bez uloženia zmien
23=Každý z vybraných súborov bude otvorený v samostatnej inštancii programu, názov poslaný BEZ úvodzoviek
24=Spustí požadovaný počet inštancií programu,/s;každá obdrží, ako parameter, jeden názov súboru zo zoznamu./s;Názov je poslaný BEZ úvodzoviek./s;UPOZORNENIE: V tomto prípade prestane OpenFileTC sledovať programy  
25=Kliknite na obrázok pre výber/s;ikony z iného umiestnenia
26=Vyberte súbor s ikonou
27=Uložiť súbor ako...
28=Klávesová skratka...
29=Nastavenie klávesovej skratky pre výber/s;programu z hlavného okna OpenFileTC
30=Zlúčiť príkazový riadok
31=Zadajte parametre do príkazového riadku. Parametre sú platné pre všetky prípony asociované s týmto programom
32=Zmeniť ikonu
33=Uložiť ikonu do súboru...
34=Vzhľad okna po spustení programu (funkčnosť negarantovaná):
35=Východzí
36=V normálnom okne
37=Minimalizované
38=Maximalizované
39=Otvoriť všetky neznáme prípony týmto programom
40=Pokiaľ OpenFileTC nenájde asociáciu pre vybranú/s;príponu, bude súbor otvorený týmto programom

[FoundClipUnit]
0=Nanájdená schránka
1=ID dát v schránke: %BufferID%
2=Preddefinované typy:
3=Upozornenie: schránka obsahuje nerozpoznané dáta. Prosím, skúste rozpoznať typ dát v schránke. Použite rozbaľovací zoznam vyššie.
4=Rozpoznať automaticky (experimentálna funkcia!)
5=Pokúsiť sa rozpoznať dátový typ automaticky (nie je doporučené)
6=Výber
7=Dátový typ bol rozpoznaný
8=Nenájdené
9=Dátový typ nebol rozpoznaný
10=Text ( ANSI )
11=Text ( OEM )
12=Text ( UNICODE )
13=Obrázok ( BMP )
14=Obrázok ( JPG )
15=Obrázok ( TIFF )
16=Metasúbor
17=Neznámy blok